Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.GetRebarHeaderItems Method
 Gets the header items from the rebar catalog header.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<RebarHeaderItem> GetRebarHeaderItems()
Public Shared Function GetRebarHeaderItems As List(Of RebarHeaderItem)
Return Value
Type: List<RebarHeaderItem>
The rebar header items.
See Also
Reference
RebarItemEnumerator Class
Tekla.Structures.Catalogs Namespace